Reports/ДвиженияВзаиморасчетовСОстатками.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>ДвиженияВзаиморасчетовСОстатками</Name>
			<Comment>Движения взаиморасчетов</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОтчета</Name>
					<Comment>Вид отчета: обороты, остатки, остатки и обороты</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьДополнительныеПоляВОтдельнойКолонке</Name>
					<Comment>Выводить дополнительные группировок в отдельной колонке</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКонца</Name>
					<Comment>Дата окончания отчета</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Comment>Дата начала отчета</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяМакетаОформленияТабличногоДокумента</Name>
					<Comment>Имя макета оформления табличного документа</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФормыНастроек</Name>
					<Comment>Текущее имя формы настроек</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьАвтоотступ</Name>
					<Comment>Истина - использовать автоотступ при выводе отчета, Ложь - не использовать автоотступ</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрыИзмеренийСтрок</Name>
					<Comment>Параметры измерений строк</Comment>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПостроительОтчета</Name>
					<Comment>Объект формирования отчета</Comment>
					<Type>
						<v8:Type>cfg:ReportBuilder</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимВыводаОтчета</Name>
					<Comment>Режим отображения: табличный документ, сводная таблица, диаграмма</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.РежимыВыводаОтчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимНастройки</Name>
					<Comment>Режим настройки отчета: стандарт, эксперт</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.РежимыНастройкиОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СохраненныеНастройки</Name>
					<Comment>Сохраненные настройки отчета</Comment>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Показатели</Name>
					<Comment>Показатели отчета</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Comment>Имя показателя</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Comment>Представление показателя</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Использование</Name>
							<Comment>Флаг использования показателя</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФорматнаяСтрока</Name>
							<Comment>Форматная строка отображения показателя</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Положение</Name>
							<Comment>Положение показателя в табличном документе</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.ПоложенияПоказателяТабличногоДокумента</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШиринаКолонки</Name>
							<Comment>Ширина колонки</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Функции</Name>
					<Comment>Функции отчета</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Comment>Имя функции</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Comment>Представление функции</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Использование</Name>
							<Comment>Флаг использования функции</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИзмеренияСтроки</Name>
					<Comment>Таблица измерений строк отчета</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Использование</Name>
							<Comment>Флаг использования измерения строки</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПутьКДанным</Name>
							<Comment>Путь к данным</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Comment>Представление</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипИзмерения</Name>
							<Comment>ТипИзмерения</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Фиксированное</Name>
							<Comment>Признак фиксированного измерения</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИзмеренияКолонки</Name>
					<Comment>Таблица измерений колонок отчета</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Использование</Name>
							<Comment>Флаг использования измерения колонки</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПутьКДанным</Name>
							<Comment>Путь к данным</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Comment>Представление</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипИзмерения</Name>
							<Comment>ТипИзмерения</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Report>
</MetaDataObject>

AccumulationRegisters/ВзаиморасчетыКомпании.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ВзаиморасчетыКомпании</Name>
			<Comment>Блок учета взаиморасчетов с контрагентами</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Comment>Сумма долга в валюте взаиморасчетов с контрагентом</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Comment>Сумма долга в валюте учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаБаз</Name>
					<Comment>Содержит сумму в базовой валюте</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Хозяйственная операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Comment>Вид операции взаиморасчетов (оплата, предоплата...)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийВзаиморасчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Контрагент, с которым мы ведем взаиморасчеты</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорВзаиморасчетов</Name>
					<Comment>Договор взаиморасчетов с контрагентом</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыВзаиморасчетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сделка</Name>
					<Comment>Документ отгрузки/поставки/оплаты по которому образовался долг</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ТипыСделок</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ЗначенияСвойствОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ЗначенияСвойствОбъектов</Name>
			<Comment>В регистре хранятся значения дополнительных свойств объектов</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Comment>Значение свойства</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.СвойстваОбъектов</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>Объект (справочник или документ) для которого существуют и могут быть назначены дополнительные свойства</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.НазначенияСвойствОбъектов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Свойство</Name>
					<Comment>Вид свойства</Comment>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СвойстваОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыОперацийВзаиморасчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыОперацийВзаиморасчетов</Name>
			<Comment>Виды операций взаиморасчетов</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НачислениеДебиторскойЗадолженности</Name>
					<Comment>Начисление дебиторской задолженности</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПогашениеКредиторскойЗадолженности</Name>
					<Comment>Погашение кредиторской задолженности</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачислениеКредиторскойЗадолженности</Name>
					<Comment>Начисление кредиторской задолженности</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПогашениеДебиторскойЗадолженности</Name>
					<Comment>Погашение дебиторской задолженности</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеКурсовойРазницыБазВалюты</Name>
					<Comment>Списание курсовой разницы базовой валюты</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеКурсовойРазницыУпрВалюты</Name>
					<Comment>Списание курсовой разницы управленческой валюты</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Reports/ДвиженияВзаиморасчетовСОстатками/Ext/ObjectModule.bsl
#Если Клиент Тогда
// Модуль отчета

////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ ОБЪЕКТА
Перем ТекстЗапроса Экспорт;                            // хранит текст запроса отчета
Перем ПараметрыИспользованияПолейИПоказателей Экспорт; // хранит параметры использования полей и показателей
Перем ДеревоДоступныхПолей Экспорт;                    // хранит дерево доступных полей отчета
Перем СтруктураСвязиСвойств Экспорт;                   // хранит структуру связи свойств
Перем ПриемникПеретаскивания Экспорт;                  // хранит перетаскиваемый объект
Перем СтруктураНеСвязанныхПоказателей Экспорт;         // хранит структуру не связанных показателей
Перем ДополнительныеПоляОтчета Экспорт;                // хранит дополнительные поля отчета
Перем ПоследовательностиОтчета Экспорт;                // хранит последовательности отчета


// возвращает структуру с видами операций ресурсов
Функция ПолучитьСтруктуруВидовОперацийРесурсов()
	
	СтруктураВидовОперацийРесурсов = Новый Структура;
	мВидыОперацийРесурса = Новый Массив;
	мВидыОперацийРесурса.Добавить(Перечисления.ВидыОперацийВзаиморасчетов.НачислениеДебиторскойЗадолженности);
	мВидыОперацийРесурса.Добавить(Перечисления.ВидыОперацийВзаиморасчетов.ПогашениеДебиторскойЗадолженности);
	СтруктураВидовОперацийРесурсов.Вставить("НамСумма", мВидыОперацийРесурса);
	
	мВидыОперацийРесурса = Новый Массив;
	мВидыОперацийРесурса.Добавить(Перечисления.ВидыОперацийВзаиморасчетов.НачислениеКредиторскойЗадолженности);
	мВидыОперацийРесурса.Добавить(Перечисления.ВидыОперацийВзаиморасчетов.ПогашениеКредиторскойЗадолженности);
	СтруктураВидовОперацийРесурсов.Вставить("МыСумма", мВидыОперацийРесурса);
	
	мВидыОперацийРесурса = Новый Массив;
	мВидыОперацийРесурса.Добавить(Перечисления.ВидыОперацийВзаиморасчетов.НачислениеДебиторскойЗадолженности);
	мВидыОперацийРесурса.Добавить(Перечисления.ВидыОперацийВзаиморасчетов.ПогашениеДебиторскойЗадолженности);
	мВидыОперацийРесурса.Добавить(Перечисления.ВидыОперацийВзаиморасчетов.НачислениеКредиторскойЗадолженности);
	мВидыОперацийРесурса.Добавить(Перечисления.ВидыОперацийВзаиморасчетов.ПогашениеКредиторскойЗадолженности);
	СтруктураВидовОперацийРесурсов.Вставить("ИтогоСумма", мВидыОперацийРесурса);
	
	мВидыОперацийРесурса = Новый Массив;
	мВидыОперацийРесурса.Добавить(Перечисления.ВидыОперацийВзаиморасчетов.НачислениеДебиторскойЗадолженности);
	мВидыОперацийРесурса.Добавить(Перечисления.ВидыОперацийВзаиморасчетов.ПогашениеДебиторскойЗадолженности);
	мВидыОперацийРесурса.Добавить(Перечисления.ВидыОперацийВзаиморасчетов.СписаниеКурсовойРазницыУпрВалюты);
	СтруктураВидовОперацийРесурсов.Вставить("НамСуммаУпр", мВидыОперацийРесурса);
	
	мВидыОперацийРесурса = Новый Массив;
	мВидыОперацийРесурса.Добавить(Перечисления.ВидыОперацийВзаиморасчетов.НачислениеКредиторскойЗадолженности);
	мВидыОперацийРесурса.Добавить(Перечисления.ВидыОперацийВзаиморасчетов.ПогашениеКредиторскойЗадолженности);
	мВидыОперацийРесурса.Добавить(Перечисления.ВидыОперацийВзаиморасчетов.СписаниеКурсовойРазницыУпрВалюты);
	СтруктураВидовОперацийРесурсов.Вставить("МыСуммаУпр", мВидыОперацийРесурса);
	
	мВидыОперацийРесурса = Новый Массив;
	мВидыОперацийРесурса.Добавить(Перечисления.ВидыОперацийВзаиморасчетов.НачислениеДебиторскойЗадолженности);
	мВидыОперацийРесурса.Добавить(Перечисления.ВидыОперацийВзаиморасчетов.ПогашениеДебиторскойЗадолженности);
	мВидыОперацийРесурса.Добавить(Перечисления.ВидыОперацийВзаиморасчетов.НачислениеКредиторскойЗадолженности);
	мВидыОперацийРесурса.Добавить(Перечисления.ВидыОперацийВзаиморасчетов.ПогашениеКредиторскойЗадолженности);
	мВидыОперацийРесурса.Добавить(Перечисления.ВидыОперацийВзаиморасчетов.СписаниеКурсовойРазницыУпрВалюты);
	СтруктураВидовОперацийРесурсов.Вставить("ИтогоСуммаУпр", мВидыОперацийРесурса);
	
	мВидыОперацийРесурса = Новый Массив;
	мВидыОперацийРесурса.Добавить(Перечисления.ВидыОперацийВзаиморасчетов.НачислениеДебиторскойЗадолженности);
	мВидыОперацийРесурса.Добавить(Перечисления.ВидыОперацийВзаиморасчетов.ПогашениеДебиторскойЗадолженности);
	мВидыОперацийРесурса.Добавить(Перечисления.ВидыОперацийВзаиморасчетов.СписаниеКурсовойРазницыБазВалюты);
	СтруктураВидовОперацийРесурсов.Вставить("НамСуммаБаз", мВидыОперацийРесурса);
	
	мВидыОперацийРесурса = Новый Массив;
	мВидыОперацийРесурса.Добавить(Перечисления.ВидыОперацийВзаиморасчетов.НачислениеКредиторскойЗадолженности);
	мВидыОперацийРесурса.Добавить(Перечисления.ВидыОперацийВзаиморасчетов.ПогашениеКредиторскойЗадолженности);
	мВидыОперацийРесурса.Добавить(Перечисления.ВидыОперацийВзаиморасчетов.СписаниеКурсовойРазницыБазВалюты);
	СтруктураВидовОперацийРесурсов.Вставить("МыСуммаБаз", мВидыОперацийРесурса);
	
	мВидыОперацийРесурса = Новый Массив;
	мВидыОперацийРесурса.Добавить(Перечисления.ВидыОперацийВзаиморасчетов.НачислениеДебиторскойЗадолженности);
	мВидыОперацийРесурса.Добавить(Перечисления.ВидыОперацийВзаиморасчетов.ПогашениеДебиторскойЗадолженности);
	мВидыОперацийРесурса.Добавить(Перечисления.ВидыОперацийВзаиморасчетов.НачислениеКредиторскойЗадолженности);
	мВидыОперацийРесурса.Добавить(Перечисления.ВидыОперацийВзаиморасчетов.ПогашениеКредиторскойЗадолженности);
	мВидыОперацийРесурса.Добавить(Перечисления.ВидыОперацийВзаиморасчетов.СписаниеКурсовойРазницыБазВалюты);
	СтруктураВидовОперацийРесурсов.Вставить("ИтогоСуммаБаз", мВидыОперацийРесурса);
	
	Возврат СтруктураВидовОперацийРесурсов;
	
КонецФункции

// возвращает текст запроса отчета
Функция ПолучитьТекстЗапроса() Экспорт
	
	ТекстВыборки = "";
	ТекстВыборкиОстатки = "";
	ТекстСгруппировать = "";
	ТекстСгруппироватьОстатки = "";
	ТекстСоединения = "";
	ТекстИндексировать = "";
	
	ПериодическийМассив = Новый Массив;
	ПериодическийМассив.Добавить("ПериодДень");
	ПериодическийМассив.Добавить("ПериодНеделя");
	ПериодическийМассив.Добавить("ПериодМесяц");
	ПериодическийМассив.Добавить("ПериодКвартал");
	ПериодическийМассив.Добавить("ПериодГод");
	
	СтруктураОписанияПериодов = Новый Структура("ПериодГод, ПериодКвартал, ПериодМесяц, ПериодНеделя, ПериодДень",
	"ГОД", "КВАРТАЛ", "МЕСЯЦ", "НЕДЕЛЯ", "ДЕНЬ");
	
	СтруктураПериодов	 = Новый Структура();
	СтруктураГруппировок = Новый Структура();
	ПериодическиеГруппировки = Новый Массив;
	МинИндекс = 99;
	ИмяПериода = "";
	ТекстПериодическойВыборки = "";
	ТекстПериодическойГруппировки = "";

	Для Каждого ТекСтрока Из ИзмеренияСтроки Цикл
		Если НЕ ТекСтрока.Использование Тогда Продолжить; КонецЕсли;
		ИмяПоля = СтрЗаменить(ТекСтрока.ПутьКДанным, ".", "");
		Если СтруктураСвязиСвойств.Свойство(ИмяПоля) Тогда
			Продолжить;
		КонецЕсли;
		Если ИмяПоля="Контрагент" ИЛИ ИмяПоля="ДоговорВзаиморасчетов" Тогда
			ТекстИндексировать = ТекстИндексировать+?(ТекстИндексировать="", "",",")+Символы.ПС+ИмяПоля;
		КонецЕсли;
		ВыражениеВыборки = "";
		Индекс = ПериодическийМассив.Найти(ИмяПоля);
		Если Индекс=Неопределено Тогда
			СтруктураГруппировок.Вставить(ИмяПоля);
		Иначе
			ТекстПериодическойВыборки = ТекстПериодическойВыборки + ",
			|	НАЧАЛОПЕРИОДА(ОстаткиИОборотыЗаПериод.Период, "+СтруктураОписанияПериодов[ИмяПоля]+") КАК "+ИмяПоля;
			ТекстПериодическойГруппировки = ТекстПериодическойГруппировки+",
			|	"+ИмяПоля;
			Если МинИндекс	> Индекс Тогда
				МинИндекс	= Индекс;
				ИмяПериода	= ИмяПоля;
			КонецЕсли;
			ПериодическиеГруппировки.Добавить(ИмяПоля);
			Продолжить;
		КонецЕсли;
		
		Если Найти(ТекСтрока.ПутьКДанным, "Организация")=1 Тогда
			ТекстСоединения = ТекстСоединения+" И ЕСТЬNULL("+Символы.ПС+"ТаблицаОборотов."+ИмяПоля+",1) = ЕСТЬNULL(ИтогиЗаПериод."+ИмяПоля+",1)";
			ВыражениеВыборки = "ОстаткиИОбороты.ДоговорВзаиморасчетов."+ТекСтрока.ПутьКДанным;
			ТекстВыборкиОстатки = ТекстВыборкиОстатки+","+Символы.ПС+"ТаблицаОстатков.ДоговорВзаиморасчетов."+ТекСтрока.ПутьКДанным+" КАК "+ИмяПоля;
			ТекстСгруппироватьОстатки = ТекстСгруппироватьОстатки+?(ТекстСгруппироватьОстатки="","",",")+Символы.ПС+"ТаблицаОстатков.ДоговорВзаиморасчетов."+ТекСтрока.ПутьКДанным;
		ИначеЕсли Найти(ТекСтрока.ПутьКДанным, "Подразделение")=1 Тогда
			ТекстСоединения = ТекстСоединения+" И ЕСТЬNULL("+Символы.ПС+"ТаблицаОборотов."+ИмяПоля+",1) = ЕСТЬNULL(ИтогиЗаПериод."+ИмяПоля+",1)";
			ВыражениеВыборки = "ОстаткиИОбороты.ДоговорВзаиморасчетов."+ТекСтрока.ПутьКДанным;
			ТекстВыборкиОстатки = ТекстВыборкиОстатки+","+Символы.ПС+"ТаблицаОстатков.ДоговорВзаиморасчетов."+ТекСтрока.ПутьКДанным+" КАК "+ИмяПоля;
			ТекстСгруппироватьОстатки = ТекстСгруппироватьОстатки+?(ТекстСгруппироватьОстатки="","",",")+Символы.ПС+"ТаблицаОстатков.ДоговорВзаиморасчетов."+ТекСтрока.ПутьКДанным;
		ИначеЕсли Найти(ТекСтрока.ПутьКДанным, "Проект")=1 Тогда
			ТекстСоединения = ТекстСоединения+" И "+Символы.ПС+" ЕСТЬNULL(ТаблицаОборотов."+ИмяПоля+",1) = ЕСТЬNULL(ИтогиЗаПериод."+ИмяПоля+",1)";
			ВыражениеВыборки = "ОстаткиИОбороты.Сделка."+ТекСтрока.ПутьКДанным;
			ТекстВыборкиОстатки = ТекстВыборкиОстатки+","+Символы.ПС+"ТаблицаОстатков.Сделка."+ТекСтрока.ПутьКДанным+" КАК "+ИмяПоля;
			ТекстСгруппироватьОстатки = ТекстСгруппироватьОстатки+?(ТекстСгруппироватьОстатки="","",",")+Символы.ПС+"ТаблицаОстатков.Сделка."+ТекСтрока.ПутьКДанным;
		ИначеЕсли Не Найти(ТекСтрока.ПутьКДанным, "ПериодРегистратор")=1 Тогда
			Если Найти(ТекСтрока.ПутьКДанным, ".")>0 Тогда
				ТекстСоединения = ТекстСоединения+" И "+Символы.ПС+" ЕСТЬNULL(ТаблицаОборотов."+ИмяПоля+",1) = ЕСТЬNULL(ИтогиЗаПериод."+ИмяПоля+",1)";
			Иначе
				ТекстСоединения = ТекстСоединения+" И "+Символы.ПС+" ТаблицаОборотов."+ИмяПоля+" = ИтогиЗаПериод."+ИмяПоля;
			КонецЕсли;
			ВыражениеВыборки = "ОстаткиИОбороты."+ТекСтрока.ПутьКДанным;
			ТекстВыборкиОстатки = ТекстВыборкиОстатки+","+Символы.ПС+"ТаблицаОстатков."+ТекСтрока.ПутьКДанным+" КАК "+ИмяПоля;
			ТекстСгруппироватьОстатки = ТекстСгруппироватьОстатки+?(ТекстСгруппироватьОстатки="","",",")+Символы.ПС+"ТаблицаОстатков."+ТекСтрока.ПутьКДанным;
		Иначе
			ВыражениеВыборки = "ОстаткиИОбороты."+СтрЗаменить(ТекСтрока.ПутьКДанным,"ПериодРегистратор","Регистратор");
		КонецЕсли;
		ТекстВыборки = ТекстВыборки+","+Символы.ПС+ВыражениеВыборки+" КАК "+ИмяПоля;
		ТекстСгруппировать = ТекстСгруппировать+","+Символы.ПС+ВыражениеВыборки;
	КонецЦикла;
	
	Пока ЗначениеЗаполнено(ИмяПериода) Цикл
		ТекИнд = ПериодическиеГруппировки.Найти(ИмяПериода);
		СтруктураДопПериодов = Новый Структура;
		ПериодическиеГруппировки.Удалить(ТекИнд);
		КоличествоДополнений = ПериодическиеГруппировки.Количество();
		Пока ТекИнд<КоличествоДополнений Цикл
			СтруктураДопПериодов.Вставить(ПериодическиеГруппировки[ТекИнд]);
			ПериодическиеГруппировки.Удалить(ТекИнд);
			КоличествоДополнений = КоличествоДополнений-1;
		КонецЦикла;
		СтруктураПериодов.Вставить(ИмяПериода, СтруктураДопПериодов);
		
		МинИндекс = 99;
		ИмяПериода = "";
		Для Каждого ТекСтрока Из ПериодическиеГруппировки Цикл
			Индекс = ПериодическийМассив.Найти(ТекСтрока);
			Если МинИндекс	> Индекс Тогда
				МинИндекс	= Индекс;
				ИмяПериода	= ТекСтрока;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Если Не ТекстИндексировать = "" Тогда
		ТекстИндексировать = "ИНДЕКСИРОВАТЬ ПО"+ТекстИндексировать;
	КонецЕсли;
	
	СтруктураВидовОперацийРесурсов = ПолучитьСтруктуруВидовОперацийРесурсов();
	
	мОтборВидыОпераций = Новый Массив;
	мОтборВидыОпераций.Добавить(Перечисления.ВидыОперацийВзаиморасчетов.НачислениеДебиторскойЗадолженности);
	мОтборВидыОпераций.Добавить(Перечисления.ВидыОперацийВзаиморасчетов.ПогашениеДебиторскойЗадолженности);
	мОтборВидыОпераций.Добавить(Перечисления.ВидыОперацийВзаиморасчетов.НачислениеКредиторскойЗадолженности);
	мОтборВидыОпераций.Добавить(Перечисления.ВидыОперацийВзаиморасчетов.ПогашениеКредиторскойЗадолженности);
	мОтборВидыОпераций.Добавить(Перечисления.ВидыОперацийВзаиморасчетов.СписаниеКурсовойРазницыУпрВалюты);
	мОтборВидыОпераций.Добавить(Перечисления.ВидыОперацийВзаиморасчетов.СписаниеКурсовойРазницыБазВалюты);
	
	Для Каждого ТекПоказатель Из Показатели Цикл
		Если Не ТекПоказатель.Использование Тогда Продолжить; КонецЕсли;
		ИспользуемыеВидыОпераций = СтруктураВидовОперацийРесурсов[ТекПоказатель.Имя];
		Для Каждого ТекОперация Из ИспользуемыеВидыОпераций Цикл
			ИндОперации = мОтборВидыОпераций.Найти(ТекОперация);
			Если ИндОперации<>Неопределено Тогда
				мОтборВидыОпераций.Удалить(ИндОперации);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	ТекстОтбора = "";
	Если мОтборВидыОпераций.Количество()>0 Тогда
		ПостроительОтчета.Параметры.Вставить("ОтборВидыОпераций", мОтборВидыОпераций);
		ТекстОтбора = "И НЕ ВзаиморасчетыКомпании.ВидОперации В (&ОтборВидыОпераций)";
	КонецЕсли;
	
	РезультатТекстЗапроса = "
	|	ВЫБРАТЬ
	|	ОстаткиИОбороты.Период КАК Период"+ТекстВыборки+",
	|	// ПРИХОД
	|	СУММА(ВЫБОР 
	|		КОГДА ОстаткиИОбороты.ВидОперации=ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаиморасчетов.НачислениеДебиторскойЗадолженности) ТОГДА ОстаткиИОбороты.СуммаОборот 
	|		ИНАЧЕ 0 
	|	КОНЕЦ) КАК НамСуммаПриход,
	|	СУММА(ВЫБОР
	|		КОГДА ОстаткиИОбороты.ВидОперации=ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаиморасчетов.НачислениеДебиторскойЗадолженности) ТОГДА ОстаткиИОбороты.СуммаУпрОборот 
	|		ИНАЧЕ 0 
	|	КОНЕЦ) КАК НамСуммаУпрПриход,
	|	СУММА(ВЫБОР
	|		КОГДА ОстаткиИОбороты.ВидОперации=ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаиморасчетов.НачислениеДебиторскойЗадолженности) ТОГДА ОстаткиИОбороты.СуммаБазОборот 
	|		ИНАЧЕ 0 
	|	КОНЕЦ) КАК НамСуммаБазПриход,
	|	СУММА(ВЫБОР 
	|		КОГДА ОстаткиИОбороты.ВидОперации=ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаиморасчетов.НачислениеКредиторскойЗадолженности) ТОГДА -ОстаткиИОбороты.СуммаОборот 
	|		ИНАЧЕ 0 
	|	КОНЕЦ) КАК МыСуммаПриход,
	|	СУММА(ВЫБОР
	|		КОГДА ОстаткиИОбороты.ВидОперации=ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаиморасчетов.НачислениеКредиторскойЗадолженности) ТОГДА -ОстаткиИОбороты.СуммаУпрОборот 
	|		ИНАЧЕ 0 
	|	КОНЕЦ) КАК МыСуммаУпрПриход,
	|	СУММА(ВЫБОР
	|		КОГДА ОстаткиИОбороты.ВидОперации=ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаиморасчетов.НачислениеКредиторскойЗадолженности) ТОГДА -ОстаткиИОбороты.СуммаБазОборот 
	|		ИНАЧЕ 0 
	|	КОНЕЦ) КАК МыСуммаБазПриход,
	|	СУММА(ОстаткиИОбороты.ИтогоСуммаПриход) КАК ИтогоСуммаПриход,
	|	СУММА(ОстаткиИОбороты.ИтогоСуммаУпрПриход) КАК ИтогоСуммаУпрПриход,
	|	СУММА(ОстаткиИОбороты.ИтогоСуммаБазПриход) КАК ИтогоСуммаБазПриход,
	|	
	|	// РАСХОД
	|	СУММА(ВЫБОР
	|		КОГДА ОстаткиИОбороты.ВидОперации=ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаиморасчетов.ПогашениеДебиторскойЗадолженности) ТОГДА -ОстаткиИОбороты.СуммаОборот
	|		ИНАЧЕ 0 
	|	КОНЕЦ) КАК НамСуммаРасход,
	|	СУММА(ВЫБОР
	|		КОГДА ОстаткиИОбороты.ВидОперации=ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаиморасчетов.ПогашениеДебиторскойЗадолженности) ТОГДА -ОстаткиИОбороты.СуммаУпрОборот
	|		ИНАЧЕ 0 
	|	КОНЕЦ+ОстаткиИОбороты.СуммаУпрРасход) КАК НамСуммаУпрРасход,
	|	СУММА(ВЫБОР
	|		КОГДА ОстаткиИОбороты.ВидОперации=ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаиморасчетов.ПогашениеДебиторскойЗадолженности) ТОГДА -ОстаткиИОбороты.СуммаБазОборот
	|		ИНАЧЕ 0 
	|	КОНЕЦ+ОстаткиИОбороты.СуммаБазРасход) КАК НамСуммаБазРасход,
	|	СУММА(ВЫБОР
	|		КОГДА ОстаткиИОбороты.ВидОперации=ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаиморасчетов.ПогашениеКредиторскойЗадолженности) ТОГДА ОстаткиИОбороты.СуммаОборот
	|		ИНАЧЕ 0 
	|	КОНЕЦ) КАК МыСуммаРасход,
	|	СУММА(ВЫБОР 
	|		КОГДА ОстаткиИОбороты.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаиморасчетов.ПогашениеКредиторскойЗадолженности) ТОГДА ОстаткиИОбороты.СуммаУпрОборот
	|		ИНАЧЕ 0
	|	КОНЕЦ+ОстаткиИОбороты.СуммаУпрПриход) КАК МыСуммаУпрРасход,
	|	СУММА(ВЫБОР 
	|		КОГДА ОстаткиИОбороты.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаиморасчетов.ПогашениеКредиторскойЗадолженности) ТОГДА ОстаткиИОбороты.СуммаБазОборот
	|		ИНАЧЕ 0
	|	КОНЕЦ+ОстаткиИОбороты.СуммаБазПриход) КАК МыСуммаБазРасход,
	|	СУММА(ОстаткиИОбороты.ИтогоСуммаРасход) КАК ИтогоСуммаРасход,
	|	СУММА(ОстаткиИОбороты.ИтогоСуммаУпрРасход) КАК ИтогоСуммаУпрРасход,
	|	СУММА(ОстаткиИОбороты.ИтогоСуммаБазРасход) КАК ИтогоСуммаБазРасход
	|	{ВЫБРАТЬ
	|	// ПРИХОД
	|	НамСуммаПриход КАК НамСуммаПриход,
	|	НамСуммаУпрПриход КАК НамСуммаУпрПриход,
	|	НамСуммаБазПриход КАК НамСуммаБазПриход,
	|	МыСуммаПриход КАК МыСуммаПриход,
	|	МыСуммаУпрПриход КАК МыСуммаУпрПриход,
	|	МыСуммаБазПриход КАК МыСуммаБазПриход,
	|	ИтогоСуммаПриход КАК ИтогоСуммаПриход,
	|	ИтогоСуммаУпрПриход КАК ИтогоСуммаУпрПриход,
	|	ИтогоСуммаБазПриход КАК ИтогоСуммаБазПриход,
	|	// РАСХОД
	|	НамСуммаРасход КАК НамСуммаРасход,
	|	НамСуммаУпрРасход КАК НамСуммаУпрРасход,
	|	НамСуммаБазРасход КАК НамСуммаБазРасход,
	|	МыСуммаРасход КАК МыСуммаРасход,
	|	МыСуммаУпрРасход КАК МыСуммаУпрРасход,
	|	МыСуммаБазРасход КАК МыСуммаБазРасход,
	|	ИтогоСуммаРасход КАК ИтогоСуммаРасход,
	|	ИтогоСуммаУпрРасход КАК ИтогоСуммаУпрРасход,
	|	ИтогоСуммаБазРасход КАК ИтогоСуммаБазРасход}
	|ПОМЕСТИТЬ ТаблицаОборотов
	|ИЗ
	|	(ВЫБРАТЬ
	|	ВзаиморасчетыКомпании.Период КАК Период,
	|	ВзаиморасчетыКомпании.Контрагент КАК Контрагент,
	|	ВзаиморасчетыКомпании.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
	|	ВзаиморасчетыКомпании.Сделка КАК Сделка,
	|	ВзаиморасчетыКомпании.Регистратор КАК Регистратор,
	|	ВзаиморасчетыКомпании.ВидОперации КАК ВидОперации,
	|	ВЫБОР
	|		КОГДА ВзаиморасчетыКомпании.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) ТОГДА ВзаиморасчетыКомпании.Сумма 
	|		ИНАЧЕ 0 
	|	КОНЕЦ КАК ИтогоСуммаПриход,
	|	ВЫБОР
	|		КОГДА ВзаиморасчетыКомпании.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) ТОГДА ВзаиморасчетыКомпании.Сумма 
	|		ИНАЧЕ 0 
	|	КОНЕЦ КАК ИтогоСуммаРасход,
	|	ВЫБОР
	|		КОГДА ВзаиморасчетыКомпании.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) ТОГДА ВзаиморасчетыКомпании.СуммаУпр 
	|		ИНАЧЕ 0 
	|	КОНЕЦ КАК ИтогоСуммаУпрПриход,
	|	ВЫБОР
	|		КОГДА ВзаиморасчетыКомпании.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) ТОГДА ВзаиморасчетыКомпании.СуммаУпр 
	|		ИНАЧЕ 0 
	|	КОНЕЦ КАК ИтогоСуммаУпрРасход,
	|	ВЫБОР
	|		КОГДА ВзаиморасчетыКомпании.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) ТОГДА ВзаиморасчетыКомпании.СуммаБаз 
	|		ИНАЧЕ 0 
	|	КОНЕЦ КАК ИтогоСуммаБазПриход,
	|	ВЫБОР
	|		КОГДА ВзаиморасчетыКомпании.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) ТОГДА ВзаиморасчетыКомпании.СуммаБаз 
	|		ИНАЧЕ 0 
	|	КОНЕЦ КАК ИтогоСуммаБазРасход,
	|	ВЫБОР                   
	|		КОГДА ВзаиморасчетыКомпании.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) ТОГДА ВзаиморасчетыКомпании.Сумма 
	|		ИНАЧЕ -ВзаиморасчетыКомпании.Сумма 
	|	КОНЕЦ КАК СуммаОборот,
	|	ВЫБОР
	|		КОГДА ВзаиморасчетыКомпании.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) ТОГДА ВзаиморасчетыКомпании.СуммаУпр 
	|		ИНАЧЕ -ВзаиморасчетыКомпании.СуммаУпр
	|	КОНЕЦ КАК СуммаУпрОборот,
	|	ВЫБОР
	|		КОГДА ВзаиморасчетыКомпании.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) ТОГДА ВзаиморасчетыКомпании.СуммаБаз 
	|		ИНАЧЕ -ВзаиморасчетыКомпании.СуммаБаз
	|	КОНЕЦ КАК СуммаБазОборот,
	|	ВЫБОР
	|		КОГДА ВзаиморасчетыКомпании.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаиморасчетов.СписаниеКурсовойРазницыУпрВалюты) И 
	|				ВзаиморасчетыКомпании.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) И ВзаиморасчетыКомпании.СуммаУпр>0 ТОГДА ВзаиморасчетыКомпании.СуммаУпр
	|		ИНАЧЕ 0 
	|	КОНЕЦ КАК СуммаУпрПриход,
	|	ВЫБОР
	|		КОГДА ВзаиморасчетыКомпании.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаиморасчетов.СписаниеКурсовойРазницыБазВалюты) И 
	|				ВзаиморасчетыКомпании.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) И ВзаиморасчетыКомпании.СуммаБаз>0 ТОГДА ВзаиморасчетыКомпании.СуммаБаз
	|		ИНАЧЕ 0 
	|	КОНЕЦ КАК СуммаБазПриход,
	|	ВЫБОР 
	|		КОГДА ВзаиморасчетыКомпании.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаиморасчетов.СписаниеКурсовойРазницыУпрВалюты) И 
	|				ВзаиморасчетыКомпании.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) И ВзаиморасчетыКомпании.СуммаУпр<0 ТОГДА -ВзаиморасчетыКомпании.СуммаУпр
	|		КОГДА ВзаиморасчетыКомпании.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаиморасчетов.СписаниеКурсовойРазницыУпрВалюты) И 
	|				ВзаиморасчетыКомпании.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) ТОГДА ВзаиморасчетыКомпании.СуммаУпр
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаУпрРасход,
	|	ВЫБОР 
	|		КОГДА ВзаиморасчетыКомпании.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаиморасчетов.СписаниеКурсовойРазницыБазВалюты) И 
	|				ВзаиморасчетыКомпании.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) И ВзаиморасчетыКомпании.СуммаБаз<0 ТОГДА -ВзаиморасчетыКомпании.СуммаБаз
	|		КОГДА ВзаиморасчетыКомпании.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВзаиморасчетов.СписаниеКурсовойРазницыБазВалюты) И 
	|				ВзаиморасчетыКомпании.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) ТОГДА ВзаиморасчетыКомпании.СуммаБаз
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаБазРасход
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыКомпании КАК ВзаиморасчетыКомпании
	|ГДЕ
	|	ВзаиморасчетыКомпании.Период МЕЖДУ &ДатаНач И &ДатаКон
	|	"+ТекстОтбора+"
	|{ГДЕ
	|	ВзаиморасчетыКомпании.ДоговорВзаиморасчетов.Организация.* КАК Организация,
	|	ВзаиморасчетыКомпании.ДоговорВзаиморасчетов.Подразделение.* КАК Подразделение,
	|	ВзаиморасчетыКомпании.Контрагент.* КАК Контрагент,
	|	ВзаиморасчетыКомпании.ДоговорВзаиморасчетов.* КАК ДоговорВзаиморасчетов,
	|	ВзаиморасчетыКомпании.Сделка.* КАК Сделка,
	|	ВзаиморасчетыКомпании.Сделка.Проект.* КАК Проект,
	|	ВзаиморасчетыКомпании.Регистратор.* КАК ПериодРегистратор}) КАК ОстаткиИОбороты
	|СГРУППИРОВАТЬ ПО
	|	ОстаткиИОбороты.Период"+ТекстСгруппировать+"
	|"+ТекстИндексировать+"
	|;
	|
	|ВЫБРАТЬ
	|	СУММА(ВЫБОР КОГДА ТаблицаОстатков.СуммаОстаток >= 0 ТОГДА ТаблицаОстатков.СуммаОстаток ИНАЧЕ 0 КОНЕЦ) КАК НамСуммаНачальныйОстаток,
	|	СУММА(ВЫБОР КОГДА ТаблицаОстатков.СуммаУпрОстаток >= 0 ТОГДА ТаблицаОстатков.СуммаУпрОстаток ИНАЧЕ 0 КОНЕЦ) КАК НамСуммаУпрНачальныйОстаток,
	|	СУММА(ВЫБОР КОГДА ТаблицаОстатков.СуммаБазОстаток >= 0 ТОГДА ТаблицаОстатков.СуммаБазОстаток ИНАЧЕ 0 КОНЕЦ) КАК НамСуммаБазНачальныйОстаток,
	|	СУММА(ВЫБОР КОГДА ТаблицаОстатков.СуммаОстаток < 0 ТОГДА -ТаблицаОстатков.СуммаОстаток ИНАЧЕ 0 КОНЕЦ) КАК МыСуммаНачальныйОстаток,
	|	СУММА(ВЫБОР КОГДА ТаблицаОстатков.СуммаУпрОстаток < 0 ТОГДА -ТаблицаОстатков.СуммаУпрОстаток ИНАЧЕ 0 КОНЕЦ) КАК МыСуммаУпрНачальныйОстаток,
	|	СУММА(ВЫБОР КОГДА ТаблицаОстатков.СуммаБазОстаток < 0 ТОГДА -ТаблицаОстатков.СуммаБазОстаток ИНАЧЕ 0 КОНЕЦ) КАК МыСуммаБазНачальныйОстаток,
	|	СУММА(ТаблицаОстатков.СуммаОстаток) КАК ИтогоСуммаНачальныйОстаток,
	|	СУММА(ТаблицаОстатков.СуммаУпрОстаток) КАК ИтогоСуммаУпрНачальныйОстаток,
	|	СУММА(ТаблицаОстатков.СуммаБазОстаток) КАК ИтогоСуммаБазНачальныйОстаток
	|"+ТекстВыборкиОстатки+"
	|{ВЫБРАТЬ
	|	НамСуммаНачальныйОстаток КАК НамСуммаНачальныйОстаток,
	|	НамСуммаУпрНачальныйОстаток КАК НамСуммаУпрНачальныйОстаток,
	|	НамСуммаБазНачальныйОстаток КАК НамСуммаБазНачальныйОстаток,
	|	МыСуммаНачальныйОстаток КАК МыСуммаНачальныйОстаток,
	|	МыСуммаУпрНачальныйОстаток КАК МыСуммаУпрНачальныйОстаток,
	|	МыСуммаБазНачальныйОстаток КАК МыСуммаБазНачальныйОстаток,
	|	ИтогоСуммаНачальныйОстаток КАК ИтогоСуммаНачальныйОстаток,
	|	ИтогоСуммаУпрНачальныйОстаток КАК ИтогоСуммаУпрНачальныйОстаток,
	|	ИтогоСуммаБазНачальныйОстаток КАК ИтогоСуммаБазНачальныйОстаток}
	|ПОМЕСТИТЬ ТаблицаОстатков
	|ИЗ
	|(ВЫБРАТЬ
	|	ВзаиморасчетыКомпанииОстатки.Контрагент КАК Контрагент,
	|	ВзаиморасчетыКомпанииОстатки.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
	|	ВзаиморасчетыКомпанииОстатки.Сделка КАК Сделка,
	|	ВзаиморасчетыКомпанииОстатки.СуммаОстаток КАК СуммаОстаток,
	|	ВзаиморасчетыКомпанииОстатки.СуммаУпрОстаток КАК СуммаУпрОстаток,
	|	ВзаиморасчетыКомпанииОстатки.СуммаБазОстаток КАК СуммаБазОстаток
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыКомпании.Остатки(&ДатаНач,
	|{
	|	ДоговорВзаиморасчетов.Организация.* КАК Организация,
	|	ДоговорВзаиморасчетов.Подразделение.* КАК Подразделение,
	|	Контрагент.* КАК Контрагент,
	|	ДоговорВзаиморасчетов.* КАК ДоговорВзаиморасчетов,
	|	Сделка.* КАК Сделка,
	|	Сделка.Проект.* КАК Проект}) КАК ВзаиморасчетыКомпанииОстатки) КАК ТаблицаОстатков
	|"+?(ТекстСгруппироватьОстатки="",""," СГРУППИРОВАТЬ ПО
	|	"+ТекстСгруппироватьОстатки)+"
	|"+ТекстИндексировать+"
	|;
	|";
	
	ТекстТаблицыОборотов = "
	|	ВЫБРАТЬ
	|	ТаблицаОборотов.Период КАК Период";
	ТекстТаблицыОстатков = "
	|	(ВЫБРАТЬ
	|	ЕСТЬNULL(ТаблицаОборотов.Период, &ДатаНач) КАК Период";
	ТекстТаблицыОбщихОборотов = "ВЫБРАТЬ
	|	ОбщаяТаблицаОборотов.Период КАК Период";
	
	ТекстВыборки = "";
	ТекстСгруппировать = "";
	Для Каждого ТекСтрока Из СтруктураГруппировок Цикл
		ИмяПоля = ТекСтрока.Ключ;
		ТекстВыборки = ТекстВыборки + "
		|	ОборотыПоПериодам."+ИмяПоля+" КАК " + ИмяПоля+",";
		ТекстТаблицыОборотов = ТекстТаблицыОборотов+",
		|	ТаблицаОборотов."+ИмяПоля+" КАК "+ИмяПоля;
		Если Найти(ИмяПоля, "ПериодРегистратор")>0 Тогда
			ТекстТаблицыОстатков = ТекстТаблицыОстатков+",
			|	ТаблицаОборотов."+ИмяПоля+" КАК "+ИмяПоля;
		Иначе
			ТекстТаблицыОстатков = ТекстТаблицыОстатков+",
			|	ЕСТЬNULL(ТаблицаОборотов."+ИмяПоля+", ТаблицаОстатков."+ИмяПоля+") КАК "+ИмяПоля;
		КонецЕсли;
		ТекстТаблицыОбщихОборотов = ТекстТаблицыОбщихОборотов+",
		|	ОбщаяТаблицаОборотов."+ИмяПоля+" КАК "+ИмяПоля;
		ТекстСгруппировать = ТекстСгруппировать+","+Символы.ПС+"ОбщаяТаблицаОборотов."+ИмяПоля;
	КонецЦикла;
	
	Для Каждого ТекПоказатель Из Показатели Цикл
		Если Не ТекПоказатель.Использование Тогда Продолжить; КонецЕсли;
		ТекстТаблицыОбщихОборотов = ТекстТаблицыОбщихОборотов+",
		|	СУММА(ОбщаяТаблицаОборотов."+ТекПоказатель.Имя+"Приход) КАК "+ТекПоказатель.Имя+"Приход,
		|	СУММА(ОбщаяТаблицаОборотов."+ТекПоказатель.Имя+"Расход) КАК "+ТекПоказатель.Имя+"Расход,
		|	СУММА(ОбщаяТаблицаОборотов."+ТекПоказатель.Имя+"Оборот) КАК "+ТекПоказатель.Имя+"Оборот,
		|	СУММА(ОбщаяТаблицаОборотов."+ТекПоказатель.Имя+"НачальныйОстатокЗаПериод) КАК "+ТекПоказатель.Имя+"НачальныйОстатокЗаПериод";
		
		ТекстТаблицыОстатков = ТекстТаблицыОстатков+",
		|	ЕСТЬNULL(ТаблицаОборотов."+ТекПоказатель.Имя+"Приход, 0) КАК "+ТекПоказатель.Имя+"Приход,
		|	ЕСТЬNULL(ТаблицаОборотов."+ТекПоказатель.Имя+"Расход, 0) КАК "+ТекПоказатель.Имя+"Расход,
		|	ЕСТЬNULL(ТаблицаОборотов."+ТекПоказатель.Имя+"Приход-ТаблицаОборотов."+ТекПоказатель.Имя+"Расход, 0) КАК "+ТекПоказатель.Имя+"Оборот,
		|	ЕСТЬNULL(ТаблицаОстатков."+ТекПоказатель.Имя+"НачальныйОстаток, 0) КАК "+ТекПоказатель.Имя+"НачальныйОстатокЗаПериод";
		
		ТекстТаблицыОборотов = ТекстТаблицыОборотов+",
		|	0 КАК "+ТекПоказатель.Имя+"Приход,
		|	0 КАК "+ТекПоказатель.Имя+"Расход,
		|	0 КАК "+ТекПоказатель.Имя+"Оборот,
		|	ИтогиЗаПериод."+ТекПоказатель.Имя+"Приход-ИтогиЗаПериод."+ТекПоказатель.Имя+"Расход КАК "+ТекПоказатель.Имя+"НачальныйОстатокЗаПериод";
	КонецЦикла;
	ТекстСоединенияОстатков = Сред(ТекстСоединения,Найти(ТекстСоединения,"И")+1);
	ТекстСоединенияОстатков = СтрЗаменить(ТекстСоединенияОстатков, "ИтогиЗаПериод.", "ТаблицаОстатков.");
	ТекстТаблицыОборотов =" 
	|"+ТекстТаблицыОстатков+"
	|ИЗ
	|	ТаблицаОборотов КАК ТаблицаОборотов
	|ПОЛНОЕ СОЕДИНЕНИЕ ТаблицаОстатков КАК ТаблицаОстатков
	|ПО"+?(ТекстСоединенияОстатков=""," ИСТИНА ", ТекстСоединенияОстатков)+"
	|ОБЪЕДИНИТЬ ВСЕ
	|"+ТекстТаблицыОборотов+"
	|ИЗ
	|	ТаблицаОборотов КАК ТаблицаОборотов
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаОборотов КАК ИтогиЗаПериод
	|ПО
	|  ТаблицаОборотов.Период > ИтогиЗаПериод.Период"+ТекстСоединения;
	
	РезультатТекстЗапроса = РезультатТекстЗапроса+Символы.ПС+ТекстТаблицыОбщихОборотов+"
	|ПОМЕСТИТЬ ОстаткиИОборотыЗаПериод
	|ИЗ
	|"+ТекстТаблицыОборотов+") КАК ОбщаяТаблицаОборотов
	|СГРУППИРОВАТЬ ПО
	|	ОбщаяТаблицаОборотов.Период"+ТекстСгруппировать+"
	|"+ТекстИндексировать+"
	|;		
	|УНИЧТОЖИТЬ ТаблицаОборотов
	|;
	|
	|УНИЧТОЖИТЬ ТаблицаОстатков
	|;
	|";
	
	ТекстТаблицыОборотов = "
	|ВЫБРАТЬ
	|	ОстаткиИОборотыЗаПериод.Период КАК Период"+ТекстПериодическойВыборки;
	
	ТекстГруппировки	= "";
	
	ТекстВыборки 			= "";
	ТекстСоединения			= "";
	ТекстСгруппировать		= "";
	ТекстСоединенияТаблиц	= "";
	Для Каждого ТекСтрока Из СтруктураГруппировок Цикл
		ИмяПоля = ТекСтрока.Ключ;
		Если ИмяПоля = "ПериодРегистратор" Тогда Продолжить; КонецЕсли;
		ТекстВыборки = ТекстВыборки + "
		|	ОборотыПоПериодам."+ИмяПоля+" КАК " + ИмяПоля+",";
		ТекстСгруппировать = ТекстСгруппировать+?(ТекстСгруппировать="", "", ",")+Символы.ПС+"ОборотыПоПериодам."+ИмяПоля;
		ТекстСоединения = ТекстСоединения + " И 
			|	ОстаткиИОборотыЗаПериод."+ИмяПоля+" = ОборотыПоПериодам."+ИмяПоля;
	КонецЦикла;
	Для Каждого ТекПериод Из СтруктураПериодов Цикл
		ИмяПериода = ТекПериод.Ключ;
		Если ИмяПериода = "Период" Тогда Продолжить; КонецЕсли;
		ВидПериода=СтруктураОписанияПериодов[ИмяПериода];
		
		РезультатТекстЗапроса = РезультатТекстЗапроса + "
		|ВЫБРАТЬ
		|	"+ТекстВыборки+"
		|	МИНИМУМ(ОборотыПоПериодам.Период) КАК ПервыйПериод,
		|	НАЧАЛОПЕРИОДА(ОборотыПоПериодам.Период, "+ВидПериода+") КАК Период
		|ПОМЕСТИТЬ
		|	Обороты"+ИмяПериода+"
		|ИЗ
		|	ОстаткиИОборотыЗаПериод КАК ОборотыПоПериодам
		|
		|СГРУППИРОВАТЬ ПО
		|	НАЧАЛОПЕРИОДА(ОборотыПоПериодам.Период, "+ВидПериода+")"+?(ТекстСгруппировать="", "",","+ТекстСгруппировать)+"
		|"+ТекстИндексировать+"
		|;
		|";
		
		Для Каждого ТекПоказатель Из Показатели Цикл
			Если Не ТекПоказатель.Использование Тогда Продолжить; КонецЕсли;
			ТекстТаблицыОборотов = ТекстТаблицыОборотов + ",
			|	ВЫБОР
			|		КОГДА ОборотыПоПериодам"+ИмяПериода+".ПервыйПериод ЕСТЬ NULL ТОГДА 0
			|	ИНАЧЕ
			|		ОстаткиИОборотыЗаПериод."+ТекПоказатель.Имя+"НачальныйОстатокЗаПериод
			|	КОНЕЦ КАК "+ТекПоказатель.Имя+"НачальныйОстатокЗа"+ИмяПериода;
		КонецЦикла;
		
		ТекстСоединенияТаблиц = ТекстСоединенияТаблиц + "
		|ЛЕВОЕ СОЕДИНЕНИЕ Обороты"+ИмяПериода+" КАК ОборотыПоПериодам"+ИмяПериода+"
		|ПО
		|	ОстаткиИОборотыЗаПериод.Период = ОборотыПоПериодам"+ИмяПериода+".ПервыйПериод"+СтрЗаменить(ТекстСоединения,"ОборотыПоПериодам", "ОборотыПоПериодам"+ИмяПериода);
		
	КонецЦикла;
		
	РезультатТекстЗапроса = РезультатТекстЗапроса + "
	|ВЫБРАТЬ
	|	"+ТекстВыборки+"
	|	МИНИМУМ(ОборотыПоПериодам.Период) КАК ПервыйПериод
	|ПОМЕСТИТЬ
	|	ОборотыОбщие
	|ИЗ
	|	ОстаткиИОборотыЗаПериод КАК ОборотыПоПериодам"+?(ТекстСгруппировать="","","
	|СГРУППИРОВАТЬ ПО "+ТекстСгруппировать)+"
	|"+ТекстИндексировать+"
	|;
	|";
	
	Для Каждого ТекПоказатель Из Показатели Цикл
		Если Не ТекПоказатель.Использование Тогда Продолжить; КонецЕсли;
		ТекстТаблицыОборотов = ТекстТаблицыОборотов + ",
		|	ВЫБОР
		|		КОГДА ОборотыОбщие.ПервыйПериод ЕСТЬ NULL ТОГДА 0
		|	ИНАЧЕ
		|		ОстаткиИОборотыЗаПериод."+ТекПоказатель.Имя+"НачальныйОстатокЗаПериод
		|	КОНЕЦ КАК "+ТекПоказатель.Имя+"НачальныйОстаток";
	КонецЦикла;
	
	ТекстСоединенияТаблиц = ТекстСоединенияТаблиц + "
	|ЛЕВОЕ СОЕДИНЕНИЕ ОборотыОбщие КАК ОборотыОбщие
	|ПО
	|	ОстаткиИОборотыЗаПериод.Период = ОборотыОбщие.ПервыйПериод"+СтрЗаменить(ТекстСоединения, "ОборотыПоПериодам", "ОборотыОбщие");
	
	Для Каждого ТекСтрока Из СтруктураГруппировок Цикл
		ИмяПоля = ТекСтрока.Ключ;
		ТекстТаблицыОборотов = ТекстТаблицыОборотов+",
		|	ОстаткиИОборотыЗаПериод."+ИмяПоля+" КАК "+ИмяПоля;
		Если ИмяПоля="ПериодРегистратор" Тогда
			ТекстГруппировки = ТекстГруппировки+ТекстПериодическойГруппировки+",
			|	Период";
		КонецЕсли;
		ТекстГруппировки = ТекстГруппировки+",
		|	"+ИмяПоля;
	КонецЦикла;
	
	СтрЗапросаСвойств      = "";
	СтрЗапросаИтогиСвойств = "";
	СтрГруппировкиСвойств  = "";
	СтрСоединенийСвойств   = "";
	Для Каждого ТекСтруктура Из СтруктураСвязиСвойств Цикл
		ИмяСвойства = СтрЗаменить(ТекСтруктура.Ключ, "Значение", "");
		Свойство = ТекСтруктура.Значение.Свойство;
		ПутьКДаннымИзмерения = "ОстаткиИОборотыЗаПериод."+ТекСтруктура.Значение.ИмяИзмерения;
		ИмяПараметра = ТекСтруктура.Значение.ИмяПараметра;
		ПолеИзмерения = ИзмеренияСтроки.Найти(ИмяПараметра, "ПутьКДанным");
//		Если ПолеИзмерения=Неопределено ИЛИ (Не ПолеИзмерения.Использование) Тогда Продолжить; КонецЕсли;
		ЗапросСвойстваПоля = ", ЕСТЬNULL(" + ИмяСвойства + ".Значение, """ + Свойство.Наименование + ": <Пусто>"") КАК " + ИмяСвойства + "Значение	//СВОЙСТВО" + Символы.ПС;
		ЗапросСвойстваГруппы = ", ЕСТЬNULL(" + ИмяСвойства + ".Значение, """ + Свойство.Наименование + ": <Пусто>"") //СВОЙСТВО" + Символы.ПС;
		ЗапросСвойстваИтоги = ",МАКСИМУМ(" + ИмяСвойства + "Значение)	//СВОЙСТВО" + Символы.ПС;
		ЗапросСвойстваСоединение = "{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК " + ИмяСвойства + " ПО " + ИмяСвойства + ".Объект = " + ПутьКДаннымИзмерения + " И " + ИмяСвойства + ".Свойство = &" + ИмяПараметра + "}	//СВОЙСТВО" + Символы.ПС;
		
		СтрЗапросаСвойств      = СтрЗапросаСвойств      + ЗапросСвойстваПоля;
		СтрЗапросаИтогиСвойств = СтрЗапросаИтогиСвойств + ЗапросСвойстваИтоги;
		СтрГруппировкиСвойств  = СтрГруппировкиСвойств  + ЗапросСвойстваГруппы;
		СтрСоединенийСвойств   = СтрСоединенийСвойств   + ЗапросСвойстваСоединение;
	КонецЦикла;
	ТекстОтбора = "";
	Если Не ПустаяСтрока(СтрЗапросаСвойств) Тогда
		ТекстОтбора = "{ГДЕ
		|	ОстаткиИОборотыЗаПериод.ПериодРегистратор КАК ПериодРегистратор
		|	"+СтрЗапросаСвойств+Символы.ПС+"//ВЫБРАННЫЕСВОЙСТВА}";
	КонецЕсли;
	СтрЗапросаСвойств      = СтрЗапросаСвойств+Символы.ПС+"//ВЫБРАННЫЕСВОЙСТВА";
	СтрЗапросаИтогиСвойств = СтрЗапросаИтогиСвойств+Символы.ПС+"//ВЫБРАННЫЕИТОГИСВОЙСТВА";
	СтрГруппировкиСвойств  = СтрГруппировкиСвойств+Символы.ПС+"//ВЫБРАННЫЕСГРУППИРОВАТЬПО";
	СтрСоединенийСвойств   = СтрСоединенийСвойств+Символы.ПС+"//ВЫБРАННЫЕСОЕДИНЕНИЯ";
	
	ТекстИтогов = "";
	ТекстИтоговНачОст = "";
	ТекстИтоговКонОст = "";
	Для Каждого ТекПоказатель Из Показатели Цикл
		Если Не ТекПоказатель.Использование Тогда Продолжить; КонецЕсли;
		ИмяПоля = ТекПоказатель.Имя;
		ТекстТаблицыОборотов = ТекстТаблицыОборотов+",
		|	ОстаткиИОборотыЗаПериод."+ИмяПоля+"Приход КАК "+ИмяПоля+"Приход,
		|	ОстаткиИОборотыЗаПериод."+ИмяПоля+"Расход КАК "+ИмяПоля+"Расход,
		|	ОстаткиИОборотыЗаПериод."+ИмяПоля+"Оборот КАК "+ИмяПоля+"Оборот,
		|	ОстаткиИОборотыЗаПериод."+ИмяПоля+"НачальныйОстатокЗаПериод КАК "+ИмяПоля+"НачальныйОстатокЗаПериод,
		|	0 КАК "+ИмяПоля+"КонечныйОстаток";
		ТекстИтогов = ТекстИтогов+?(ТекстИтогов="", "", ",")+"
		|	СУММА("+ИмяПоля+"Приход),
		|	СУММА("+ИмяПоля+"Расход),
		|	СУММА("+ИмяПоля+"Оборот)";
		ТекстИтоговНачОст = ",
		|	(ВЫБОР
		|		КОГДА (НЕ ПериодРегистратор ЕСТЬ NULL) ИЛИ (НЕ Период ЕСТЬ NULL) ТОГДА СУММА("+ИмяПоля+"НачальныйОстатокЗаПериод)";
		ТекстИтоговОст = ",
		|	(ВЫБОР
		|		КОГДА (НЕ ПериодРегистратор ЕСТЬ NULL) ИЛИ (НЕ Период ЕСТЬ NULL) ТОГДА СУММА("+ИмяПоля+"НачальныйОстатокЗаПериод)";
		Для Каждого ТекПериод Из СтруктураПериодов Цикл
			ТекстИтоговОст = ТекстИтоговОст+"
			|		КОГДА (НЕ "+ТекПериод.Ключ+" ЕСТЬ NULL) ТОГДА СУММА("+ИмяПоля+"НачальныйОстатокЗа"+ТекПериод.Ключ+")";
		КонецЦикла;
		ТекстИтогов = ТекстИтогов+ТекстИтоговОст+"
		|	ИНАЧЕ СУММА("+ИмяПоля+"НачальныйОстаток)
		|КОНЕЦ) КАК "+ИмяПоля+"НачальныйОстаток"+ТекстИтоговОст+"
		|	ИНАЧЕ СУММА("+ИмяПоля+"НачальныйОстаток)
		|КОНЕЦ)+ СУММА("+ИмяПоля+"Оборот) КАК "+ИмяПоля+"КонечныйОстаток";
	КонецЦикла;
	
	РезультатТекстЗапроса = РезультатТекстЗапроса+Символы.ПС+ТекстТаблицыОборотов+"
	|	"+СтрЗапросаСвойств+"
	|ИЗ
	|	ОстаткиИОборотыЗаПериод КАК ОстаткиИОборотыЗаПериод"+ТекстСоединенияТаблиц+"
	|	"+СтрСоединенийСвойств+"
	|	"+ТекстОтбора+"
	|ИТОГИ
	|	"+ТекстИтогов+"
	|	"+СтрЗапросаИтогиСвойств+"
	|ПО
	|	ОБЩИЕ"+ТекстГруппировки+"
	|	"+СтрЗапросаСвойств+"
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	СтрЗапросаСвойств      = СтрЗапросаСвойств+Символы.ПС+"//ВЫБРАННЫЕСВОЙСТВА";

	Возврат РезультатТекстЗапроса;
	
КонецФункции // ПолучитьТекстЗапроса()

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОПОЛНИТЕЛЬНЫХ МЕТОДОВ ОБЪЕКТА

// Стандартная процедура настройки построителя отчета 
//
// Параметры
//  ИмяМакета  – строка – название макета
//
//  ИмяМакетаПараметров  – строка – название макета параметров
//
Процедура ЗаполнитьНачальныеНастройки(ИмяМакета, ИмяМакетаПараметров="Параметры") Экспорт
	
	// Заполним структуру параметров
	СтруктураПараметрыЗаполнения = Новый Структура();
	СтруктураПараметрыЗаполнения.Вставить("ОтчетОбъект",            ЭтотОбъект);
	СтруктураПараметрыЗаполнения.Вставить("ИмяМакетаТекстаЗапроса", ИмяМакета);
	СтруктураПараметрыЗаполнения.Вставить("ИмяМакетаПараметров",    ИмяМакетаПараметров);
	отЗаполнитьНачальныеНастройки(СтруктураПараметрыЗаполнения, глПрава);
	
КонецПроцедуры	//	ЗаполнитьНачальныеНастройки()

// формирует отчет в виде табличного документа
//
// Параметры
//  ДокументРезультат – ТабличныйДокумент или ПолеТабличногоДокумента
//
// Возвращаемое значение:
//  Результат - ТабличныйДокумент
//
Функция СформироватьТабличныйДокумент(ДокументРезультат=Неопределено) Экспорт

	Результат = отСформироватьТабличныйДокумент(ЭтотОбъект, ДокументРезультат,, глПрава);
	
	Возврат Результат;
	
КонецФункции // ЗаполнитьНачальныеНастройки()

// Функция возвращает структуру форматирования полей
//
// Без параметров
//  
// Возвращаемое значение:
//  СтруктураФорматаПолей - структура
//
Функция СтруктураФорматированияПолей() Экспорт

	СтруктураФорматаПолей = Новый Структура;
	отСтруктураФорматированияПолей(ЭтотОбъект, СтруктураФорматаПолей);

	// Если необходимо, добавим другие или переустановим строки форматирования полей
	
	Возврат СтруктураФорматаПолей;

КонецФункции	//	СтруктураФорматированияПолей()

//////////////////////////////////////////////////////////////////////////////////
//// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ

отОтчетПриИнициализацииОбъекта(ЭтотОбъект);
ПромежуточныеЗначенияПостроителя = Новый Структура();
СтруктураНеСвязанныхПоказателей = Новый Структура();
ПоследовательностиОтчета = Новый Структура();
ПоследовательностиОтчета.Вставить("ГраницыВзаиморасчетов");

#КонецЕсли
